Выполните функции в Eshell с любыми тестовыми данными:

- string:tokens/2\
- string:join/2\
- string:strip/1, string:strip/2\
- string:to_upper/1, string:to_lower/1\
- string:to_integer/1 и erlang:list_to_integer/1

```erlang
1> string:tokens("I*wanna*to*work*at*Eltex", "*").
["I","wanna","to","work","at","Eltex"]
2> string:join(["keylist1", "keylist2", "keylist3"],",").
"keylist1,keylist2,keylist3"
3> string:join(["keylist1", "keylist2", "keylist3"], ", ").
"keylist1, keylist2, keylist3"
4> SomeString = "   Erlang is so good     ".
"   Erlang is so good     "
5> string:strip(SomeString).
"Erlang is so good"
6> string:strip(SomeString, both).
"Erlang is so good"
7> string:strip(SomeString, left).
"Erlang is so good     "
8> string:strip(SomeString, right).
"   Erlang is so good"
9> string:to_upper("small letters").
"SMALL LETTERS"
10> string:to_lower("BIG LETTERS").
"big letters"
11> string:to_integer("812SaintP").
{812,"SaintP"}
12> string:to_integer("812").
{812,[]}
13> string:to_integer("SaintP").
{error,no_integer}
14> list_to_integer("812").
812
15> list_to_integer("812SaintP").
** exception error: bad argument
     in function  list_to_integer/1
        called as list_to_integer("812SaintP")
        *** argument 1: not a textual representation of an integer
16> list_to_integer("SaintP").
** exception error: bad argument
     in function  list_to_integer/1
        called as list_to_integer("SaintP")
        *** argument 1: not a textual representation of an integer
```

- erlang:byte_size/1
- erlang:split_binary/2
- erlang:binary_part/3
- binary:split/2
- binary:match/2, binary:matches/3
- binary:replace/3
- binary_to_list/1
- list_to_binary/1
- lists:flatten/1

```erlang
18> byte_size(<<"long string">>).
11
19> split_binary(<<"long string">>, 5).
{<<"long ">>,<<"string">>}
20> binary_part(<<"long string">>, 5, 6).
<<"string">>
37> Str = <<"Hello world!"/utf8>>.
<<"Hello world!">>
38> binary:split(Str, [<<" ">>]).
[<<"Hello">>,<<"world!">>]
39> binary:split(Str, [<<" ">>, <<"o">>]).
[<<"Hell">>,<<" world!">>]
40> binary:split(Str, [<<" ">>, <<"l">>]).
[<<"He">>,<<"lo world!">>]
41> binary:split(Str, [<<" ">>, <<"l">>], [global]).
[<<"He">>,<<>>,<<"o">>,<<"wor">>,<<"d!">>]
42> binary:match(<<"ggwp ggwp ggwp">>, <<"gg">>).
{0,2}
43> binary:matches(<<"ggwp ggwp ggwp">>, <<"gg">>).
[{0,2},{5,2},{10,2}]
44> binary:replace(<<"Hello">>, <<"o">>, <<" ">>).
<<"Hell ">>
45> binary_to_list(<<"Binaryyy">>).
"Binaryyy"
46> list_to_binary("listtt").
<<"listtt">>
47> List = [1, [2, [3, 4], 5], 6].
[1,[2,[3,4],5],6]
48> FlatList = lists:flatten(List).
[1,2,3,4,5,6]
```
