# 10. Gen_server
## Задание \#1
Реализуйте логику модулей keylist.erl и keylist_mgr.erl с помощью gen_server.
## Задание \#2
Изменение в keylist_mgr при создании нового keylist процесса рассылает всем существующим процессам keylist сообщение {added_new_child, NewPid, NewName}, NewPid - пид нового процесса и NewName - имя нового процесса.

keylist просто логирует сообщение (используем io:format/2).

Посылка сообщения {added_new_child, NewPid, NewName} происходит с помощью Pid ! {added_new_child, ......} или send(Pid, {added_new_child, ......}).
## Задание \#3
Обновите spec для keylist.erl и keylist_mgr.erl
Документацию не обязательно обновлять.
## Задание \#4
Протестируйте работу модулей в Eshell.
```erlang
Eshell V14.1 (press Ctrl+G to abort, type help(). for help)
1> c(keylist_srv).
{ok,keylist_srv}
2> c(keylist_mgr_srv).
{ok,keylist_mgr_srv}
3> rr("keylist_srv.erl").
[stateChild]
4> rr("keylist_mgr_srv.erl").
[state]
5> keylist_mgr_srv:start_monitor().
Monitor Process Init: {ok,<0.103.0>}
6> keylist_mgr_srv:start_child(keylist1, permanent).
Process Init:
{ok,<0.105.0>}
7> keylist_srv:add(keylist1, mykey1, 1, "Comm1").
Added new element: {mykey1,1,"Comm1"}
{ok,#stateChild{list = [{mykey1,1,"Comm1"}],counter = 1}}
8> keylist_srv:add(keylist1, mykey2, 2, "Comm2").
Added new element: {mykey2,2,"Comm2"}
{ok,#stateChild{list = [{mykey1,1,"Comm1"},
                        {mykey2,2,"Comm2"}],
                counter = 2}}
9> keylist_srv:is_member(keylist1, mykey2).
Element with the key: mykey2 exist: true
{ok,true,3}
10> keylist_srv:take(keylist1, mykey1).
Element {mykey1,1,"Comm1"} with the key: mykey1 removed
{ok,{mykey1,1,"Comm1"},4}
11> keylist_srv:find(keylist1, mykey2).
Found element: {mykey2,2,"Comm2"}
{ok,{mykey2,2,"Comm2"},5}
12> keylist_mgr_srv:start_child(keylist2, temporary).
Process Init:
Received added_new_child message. NewPid: <0.112.0>, NewName: keylist2
{ok,<0.112.0>}
13> keylist_mgr_srv:start_child(keylist3, permanent).
Process Init:
Received added_new_child message. NewPid: <0.114.0>, NewName: keylist3
Received added_new_child message. NewPid: <0.114.0>, NewName: keylist3
{ok,<0.114.0>}
14> keylist_mgr_srv:start_child(keylist4, temporary).
Process Init:
Received added_new_child message. NewPid: <0.116.0>, NewName: keylist4
Received added_new_child message. NewPid: <0.116.0>, NewName: keylist4
Received added_new_child message. NewPid: <0.116.0>, NewName: keylist4
{ok,<0.116.0>}
15> keylist_mgr_srv:get_names().
Children: [{keylist1,<0.105.0>},
           {keylist2,<0.112.0>},
           {keylist3,<0.114.0>},
           {keylist4,<0.116.0>}], Permanent: [<0.114.0>,<0.105.0>]
ok
16> exit(whereis(keylist3), kill).
=ERROR REPORT==== 29-Nov-2023::02:08:23.085000 ===

Process keylist3 failed with reason: killed

Process Init:
true
New Pid permanent process: <0.119.0>
Received added_new_child message. NewPid: <0.119.0>, NewName: keylist3
Received added_new_child message. NewPid: <0.119.0>, NewName: keylist3
Received added_new_child message. NewPid: <0.119.0>, NewName: keylist3
Received added_new_child message. NewPid: <0.119.0>, NewName: keylist3
17> keylist_mgr_srv:get_names().
Children: [{keylist3,<0.119.0>},
           {keylist1,<0.105.0>},
           {keylist2,<0.112.0>},
           {keylist4,<0.116.0>}], Permanent: [<0.119.0>,<0.105.0>]
ok
18> keylist_mgr_srv:stop_child(keylist1).
Received stop request
ok
19> keylist_mgr_srv:get_names().
Children: [{keylist3,<0.119.0>},{keylist2,<0.112.0>},{keylist4,<0.116.0>}], Permanent: [<0.119.0>]
ok
```