# 10. Gen_server
## Задание \#1
Реализуйте логику модулей keylist.erl и keylist_mgr.erl с помощью gen_server.
## Задание \#2
Изменение в keylist_mgr при создании нового keylist процесса рассылает всем существующим процессам keylist сообщение {added_new_child, NewPid, NewName}, NewPid - пид нового процесса и NewName - имя нового процесса.

keylist просто логирует сообщение (используем io:format/2).

Посылка сообщения {added_new_child, NewPid, NewName} происходит с помощью Pid ! {added_new_child, ......} или send(Pid, {added_new_child, ......}).
## Задание \#3
Обновите spec для keylist.erl и keylist_mgr.erl
Документацию не обязательно обновлять.
## Задание \#4
Протестируйте работу модулей в Eshell.
```erlang
Eshell V14.1 (press Ctrl+G to abort, type help(). for help)
1> c(keylist_srv).
keylist_srv.erl:12:2: Warning: undefined callback function handle_cast/2 (behaviour 'gen_server')
%   12| -behavior(gen_server).
%     |  ^

{ok,keylist_srv}
2> c(keylist_mgr).
{ok,keylist_mgr}
3> rr("keylist_srv.erl").
[stateChild]
4> rr("keylist_mgr.erl").
[state]
5> keylist_mgr:start_monitor().
Monitor Process Init: {ok,{<0.103.0>,#Ref<0.1201524314.1245184001.167730>}}
6> keylist_mgr:start_child(keylist1, permanent).
Process Init:
{ok,<0.105.0>}
7> keylist_srv:add(keylist1, mykey1, 1, "Comm1").
Added new element: {mykey1,1,"Comm1"}
{ok,#stateChild{list = [{mykey1,1,"Comm1"}],counter = 1}}
8> keylist_srv:add(keylist1, mykey2, 2, "Comm2").
Added new element: {mykey2,2,"Comm2"}
{ok,#stateChild{list = [{mykey1,1,"Comm1"},
                        {mykey2,2,"Comm2"}],
                        counter = 2}}
9> keylist_srv:is_member(keylist1, mykey2).
Element with the key: mykey2 exist: true
{ok,true,3}
10> keylist_srv:take(keylist1, mykey1).
Element {mykey1,1,"Comm1"} with the key: mykey1 removed
{ok,{mykey1,1,"Comm1"},4}
11> keylist_srv:find(keylist1, mykey2).
Found element: {mykey2,2,"Comm2"}
{ok,{mykey2,2,"Comm2"},5}
12> keylist_mgr:start_child(keylist2, temporary).
Process Init:
Received added_new_child message. Pid: <0.112.0>, Name: keylist2
{ok,<0.112.0>}
13> keylist_mgr:start_child(keylist3, permanent).
Process Init:
Received added_new_child message. Pid: <0.114.0>, Name: keylist3
Received added_new_child message. Pid: <0.114.0>, Name: keylist3
{ok,<0.114.0>}
14> keylist_mgr:start_child(keylist4, temporary).
Process Init:
Received added_new_child message. Pid: <0.116.0>, Name: keylist4
Received added_new_child message. Pid: <0.116.0>, Name: keylist4
Received added_new_child message. Pid: <0.116.0>, Name: keylist4
{ok,<0.116.0>}
15> keylist_mgr:get_names().
Children: [{keylist1,<0.105.0>},
           {keylist2,<0.112.0>},
           {keylist3,<0.114.0>},
           {keylist4,<0.116.0>}], Permanent: [<0.114.0>,<0.105.0>]
ok
16> exit(whereis(keylist1), kill).
Process Init:
=ERROR REPORT==== 30-Nov-2023::06:31:02.188000 ===

Process keylist1 failed with reason: killed

true
New Pid permanent process: <0.119.0>
17> exit(whereis(keylist2), kill).
Received added_new_child message. Pid: <0.119.0>, Name: keylist1
Received added_new_child message. Pid: <0.119.0>, Name: keylist1
Received added_new_child message. Pid: <0.119.0>, Name: keylist1
=ERROR REPORT==== 30-Nov-2023::06:31:02.195000 ===

Process keylist2 failed with reason: killed

true
Received added_new_child message. Pid: <0.112.0>, Name: keylist2
Received added_new_child message. Pid: <0.112.0>, Name: keylist2
Received added_new_child message. Pid: <0.112.0>, Name: keylist2
18> keylist_mgr:get_names().
Children: [{keylist1,<0.119.0>},{keylist3,<0.114.0>},{keylist4,<0.116.0>}], Permanent: [<0.119.0>,
<0.114.0>]
ok
19> keylist_mgr:stop_child(keylist1).
Proc <0.119.0> terminating reason: normal in state: {stateChild,[],0}
ok
20> keylist_mgr:get_names().
Children: [{keylist3,<0.114.0>},{keylist4,<0.116.0>}], Permanent: [<0.114.0>]
ok
21> keylist_mgr:stop().
Proc <0.103.0> terminating reason: normal in state: {state,
                                                    [{keylist3,<0.114.0>},
                                                    {keylist4,<0.116.0>}],
                                                    [<0.114.0>]}
ok
Proc <0.114.0> terminating reason: normal in state: {stateChild,[],0}
Proc <0.116.0> terminating reason: normal in state: {stateChild,[],0}
```